ERP DEV.WMS/src/DataProcessors/ЗагрузкаМестХранения/ЗагрузкаМестХранения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаМестХранения</name>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

ERP DEV.WMS/src/Enums/вмс_ТипыЯчеек/вмс_ТипыЯчеек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>вмс_ТипыЯчеек</name>
  <enumValues>
    <name>ЗонаПриемки</name>
  </enumValues>
  <enumValues>
    <name>ЗонаОтгрузки</name>
  </enumValues>
  <enumValues>
    <name>Хранение</name>
  </enumValues>
  <enumValues>
    <name>ЗонаОтбора</name>
  </enumValues>
  <enumValues>
    <name>Карантин</name>
  </enumValues>
  <enumValues>
    <name>ЗонаКонтроля</name>
  </enumValues>
  <enumValues>
    <name>Подпитка</name>
  </enumValues>
  <enumValues>
    <name>Оператор</name>
  </enumValues>
  <enumValues>
    <name>Транзит</name>
  </enumValues>
</mdclass:Enum>

ERP DEV.WMS/src/Catalogs/вмс_МестаХранения/вмс_МестаХранения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_МестаХранения</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Склады</owners>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЯчейки</name>
    <type>
      <types>EnumRef.вмс_ТипыЯчеек</types>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.КатегорииЯчеекХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.вмс_Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>СортировкаНомер</name>
    <comment>Сквозная в длину нумерация (техническая)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СортировкаРяд</name>
    <comment>Сквозная в ширину нумерация (техническая)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СортировкаЭтаж</name>
    <comment>Нумерация в высоту (техническая)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаБезразмерная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеТехническое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСверху</name>
    <comment>ТУ_Августинович 000056225 28.10.2025. Для интерактивной карты</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧастьНаименованияСклад</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧастьНаименованияРяд</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧастьНаименованияСтеллаж</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧастьНаименованияЯрус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧастьНаименованияМесто</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ERP DEV.WMS/src/DataProcessors/ЗагрузкаМестХранения/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для каждого Элемент из Метаданные.Справочники.вмс_МестаХранения.Владельцы цикл
		Источник = Элемент.Имя;
		Прервать;
	КонецЦикла;
	
	Текст =
	"ВЫБРАТЬ
	|	Склады.Ссылка КАК Ссылка,
	|	Склады.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	НЕ Склады.ЭтоГруппа
	|	И НЕ Склады.ПометкаУдаления
	|	И ИСТИНА";
	
	ИмяСправочникаСклады = вмс_АдаптацияКонфигураций.ПолучитьИмяСправочникаСклады(); 
	ИмяПараметраТипСклада = вмс_АдаптацияКонфигураций.ПолучитьИмяПараметраТипСклада();
	
	Текст = СтрЗаменить(Текст,"Справочник.Склады","Справочник." +ИмяСправочникаСклады);
	
	Текст = СтрЗаменить(Текст,"НЕ Склады.ЭтоГруппа",
	?(вмс_АдаптацияКонфигураций.ИерархическийСправочник(ИмяСправочникаСклады) = Истина,
	"НЕ Склады.ЭтоГруппа",
	"ИСТИНА"));   
	
	Текст = СтрЗаменить(Текст,"ТипСклада",ИмяПараметраТипСклада);
	
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр(ИмяПараметраТипСклада,вмс_АдаптацияКонфигураций.ПолучитьТипСкладаОптовый());
	
	Запрос.Текст = Текст;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		Элементы.Владелец.СписокВыбора.Добавить(Выборка.Ссылка,Выборка.Наименование);
	КонецЦикла;
	
КонецПроцедуры  

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Загрузить(Команда)
	
	Если ЗначениеЗаполнено(Объект.Склад) Тогда 
		СтруктураМестХранения = Новый структура; 
		Предел = 2; 
		Пока Предел <= ТабличныйДокумент.ВысотаТаблицы Цикл
			
			// ТУ_Августинович ++ 000056225 27.10.2025
			// - В табличный документ добавлены новые колонки (Склад, Ряд, Стеллаж, Ярус, Место)
			
			//Место = Новый Структура("Наименование, Объем",ТабличныйДокумент.Область(Предел,1).Текст,ТабличныйДокумент.Область(Предел,2).Текст); 
			Место = Новый Структура;
			Место.Вставить("Наименование",	ТабличныйДокумент.Область(Предел, 1).Текст);
			Место.Вставить("Склад",			ТабличныйДокумент.Область(Предел, 2).Текст);
			Место.Вставить("Ряд",			ТабличныйДокумент.Область(Предел, 3).Текст);
			Место.Вставить("Стеллаж",		ТабличныйДокумент.Область(Предел, 4).Текст);
			Место.Вставить("Ярус",			ТабличныйДокумент.Область(Предел, 5).Текст);
			Место.Вставить("Место",			ТабличныйДокумент.Область(Предел, 6).Текст);
			Место.Вставить("ВидСверху",		ТабличныйДокумент.Область(Предел, 7).Текст);
			Место.Вставить("Объем",			ТабличныйДокумент.Область(Предел, 8).Текст);
			//3.2.4
			Место.Вставить("Штрихкод",		ТабличныйДокумент.Область(Предел, 9).Текст);
			// ТУ_Августинович -- 27.10.2025
			
			// ТУ_Самойленко 26.05.23 ++
			СтруктураМестХранения.Вставить("место"+(Формат(Предел-1, "ЧГ=")),Место); // Исправлена загрузка ячеек, в количестве, превышающем 999 шт.
			// ТУ_Самойленко 26.05.23 --
			Предел=Предел+1;
		КонецЦикла;
		
		ЗагрузитьНаСервере(СтруктураМестХранения,Объект.Склад); 
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Готово";
		Сообщение.УстановитьДанные(Элементы.Владелец);
		Сообщение.Сообщить();
	Иначе 
		ОбщегоНазначенияКлиент.СообщитьПользователю("Место хранения для создания ячейки не выбрано");
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере(Массив,Владелец)
	
	Для Каждого СтрокаДокумента из Массив Цикл
		
		ДанныеСтроки = СтрокаДокумента.Значение;
		
		лЗапрос= Новый Запрос;
		лЗапрос.Текст =
		
		"ВЫБРАТЬ
		|	вмс_МестаХранения.Владелец КАК Владелец,
		|	вмс_МестаХранения.Наименование КАК Наименование,
		|	вмс_МестаХранения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.вмс_МестаХранения КАК вмс_МестаХранения
		|ГДЕ
		|	вмс_МестаХранения.Владелец = &Владелец
		|	И вмс_МестаХранения.Наименование = &Наименование";
		
		лЗапрос.УстановитьПараметр("Владелец",Владелец);
		лЗапрос.УстановитьПараметр("Наименование",ДанныеСтроки.Наименование);
		ВыборкаПоСкладу =лЗапрос.Выполнить().Выгрузить();
		
		Если ВыборкаПоСкладу.Количество() = 0 Тогда
			Запись = Справочники.вмс_МестаХранения.СоздатьЭлемент();
			Запись.Заполнить(Неопределено);
			Если ДанныеСтроки.Наименование = "" тогда
				ОбщегоНазначения.СообщитьПользователю("Невозможно создание неименованной ячейки");
				Продолжить;	
			КонецЕсли;
			Запись.Наименование = ДанныеСтроки.Наименование;
			Запись.ТипЯчейки = Перечисления.вмс_ТипыЯчеек.Хранение;
			Запись.Владелец = Владелец; 
			
			// ТУ_Августинович ++ 000056225 30.10.2025
			// - Передаем составные части наименования. Необходимы для интерактивной карты склада
			Запись.ЧастьНаименованияСклад	= ДанныеСтроки.Склад;
			Запись.ЧастьНаименованияРяд		= ДанныеСтроки.Ряд;
			Запись.ЧастьНаименованияСтеллаж	= ДанныеСтроки.Стеллаж;
			Запись.ЧастьНаименованияЯрус	= ДанныеСтроки.Ярус;
			Запись.ЧастьНаименованияМесто	= ДанныеСтроки.Место;
			Запись.ВидСверху				= ДанныеСтроки.ВидСверху;
			//3.2.4
			Запись.Штрихкод					= ДанныеСтроки.Штрихкод;
			// ТУ_Августинович -- 30.10.2025
			
			Запись.Записать();
		Иначе
			Ячейка = ВыборкаПоСкладу[0].Ссылка.ПолучитьОбъект();
			Ячейка.Объем = ДанныеСтроки.Объем;
			
			// ТУ_Августинович ++ 000056225 30.10.2025
			// - Передаем составные части наименования. Необходимы для интерактивной карты склада
			Ячейка.ЧастьНаименованияСклад	= ДанныеСтроки.Склад;
			Ячейка.ЧастьНаименованияРяд		= ДанныеСтроки.Ряд;
			Ячейка.ЧастьНаименованияСтеллаж	= ДанныеСтроки.Стеллаж;
			Ячейка.ЧастьНаименованияЯрус	= ДанныеСтроки.Ярус;
			Ячейка.ЧастьНаименованияМесто	= ДанныеСтроки.Место;
			Ячейка.ВидСверху				= ДанныеСтроки.ВидСверху;
			Ячейка.Штрихкод					= ДанныеСтроки.Штрихкод;
			// ТУ_Августинович -- 30.10.2025
			
			Ячейка.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
